data = [{
    "学校": "三亚市第一中学",
    "考生姓名": "陈乐祺",
    "班级": "15",
    "准考证号": "554610221503",
    "考试成绩": [
        {
            "科目": "总分",
            "分数": 401.0,
            "班级排名": 10,
            "学校排名": 462,
            "联考排名": 5753,
            "已选科目": 1
        },
        {
            "科目": "语文",
            "分数": 83.0,
            "班级排名": 40,
            "学校排名": 734,
            "联考排名": 14810,
            "已选科目": 1
        },
        {
            "科目": "数学",
            "分数": 38.0,
            "班级排名": 34,
            "学校排名": 870,
            "联考排名": 22798,
            "已选科目": 1
        },
        {
            "科目": "外语",
            "分数": 110.0,
            "班级排名": 2,
            "学校排名": 185,
            "联考排名": 3014,
            "已选科目": 1
        },
        {
            "科目": "政治",
            "分数": 0.0,
            "班级排名": 1,
            "学校排名": 335,
            "联考排名": 20517,
            "已选科目": 0
        },
        {
            "科目": "历史",
            "分数": 0.0,
            "班级排名": 32,
            "学校排名": 351,
            "联考排名": 17258,
            "已选科目": 0
        },
        {
            "科目": "地理",
            "分数": 76.0,
            "班级排名": 2,
            "学校排名": 9,
            "联考排名": 50,
            "已选科目": 1
        },
        {
            "科目": "物理",
            "分数": 57.0,
            "班级排名": 3,
            "学校排名": 194,
            "联考排名": 3761,
            "已选科目": 1
        },
        {
            "科目": "化学",
            "分数": 37.0,
            "班级排名": 17,
            "学校排名": 528,
            "联考排名": 10227,
            "已选科目": 1
        },
        {
            "科目": "生物",
            "分数": 0.0,
            "班级排名": 2,
            "学校排名": 554,
            "联考排名": 29348,
            "已选科目": 0
        }
    ],
    "班级考试情况": [
        {
            "科目": "总分",
            "平均分": 359.0,
            "最高分": 505.0
        },
        {
            "科目": "语文",
            "平均分": 87.42,
            "最高分": 107.0
        },
        {
            "科目": "数学",
            "平均分": 47.5,
            "最高分": 101.0
        },
        {
            "科目": "外语",
            "平均分": 78.48,
            "最高分": 111.0
        },
        {
            "科目": "政治",
            "平均分": 0.0,
            "最高分": 0.0
        },
        {
            "科目": "历史",
            "平均分": 57.52,
            "最高分": 73.0
        },
        {
            "科目": "地理",
            "平均分": 57.52,
            "最高分": 81.0
        },
        {
            "科目": "物理",
            "平均分": 34.94,
            "最高分": 84.0
        },
        {
            "科目": "化学",
            "平均分": 48.4,
            "最高分": 75.0
        },
        {
            "科目": "生物",
            "平均分": 12.0,
            "最高分": 12.0
        }
    ],
    "学校考试情况": [
        {
            "科目": "总分",
            "平均分": 391.57, "最高分": 640.0
        },
        {
            "科目": "语文",
            "平均分": 88.93,
            "最高分": 122.0
        },
        {
            "科目": "数学",
            "平均分": 63.27,
            "最高分": 135.0
        },
        {
            "科目": "外语",
            "平均分": 87.26,
            "最高分": 136.0
        },
        {
            "科目": "政治",
            "平均分": 47.83,
            "最高分": 89.0
        },
        {
            "科目": "历史",
            "平均分": 58.14,
            "最高分": 82.0
        },
        {
            "科目": "地理",
            "平均分": 56.82,
            "最高分": 81.0
        },
        {
            "科目": "物理",
            "平均分": 49.22,
            "最高分": 100.0
        },
        {
            "科目": "化学",
            "平均分": 54.05, "最高分": 94.0
        },
        {
            "科目": "生物",
            "平均分": 39.77,
            "最高分": 83.0
        }
    ],
    "联考考试情况": [
        {
            "科目": "总分",
            "平均分": 282.7,
            "最高分": 651.0
        },
        {
            "科目": "语文",
            "平均分": 73.51,
            "最高分": 126.0
        },
        {
            "科目": "数学", "平均分": 42.28, "最高分": 147.0
        },
        {
            "科目": "外语",
            "平均分": 57.65,
            "最高分": 144.0
        },
        {
            "科目": "政治",
            "平均分": 37.73,
            "最高分": 89.0
        },
        {
            "科目": "历史",
            "平均分": 46.33,
            "最高分": 89.0
        },
        {
            "科目": "地理",
            "平均分": 45.37,
            "最高分": 86.0
        },
        {
            "科目": "物理",
            "平均分": 37.36,
            "最高分": 100.0
        },
        {
            "科目": "化学",
            "平均分": 39.19,
            "最高分": 99.0
        },
        {
            "科目": "生物",
            "平均分": 31.08,
            "最高分": 97.0
        }
    ],
    "分数分布情况": [
        {
            "区间": "0_100",
            "人数": 986
        },
        {
            "区间": "100_200",
            "人数": 8721
        },
        {
            "区间": "200_300",
            "人数": 21146
        },
        {
            "区间": "300_400",
            "人数": 12825
        },
        {
            "区间": "400_500",
            "人数": 4895
        },
        {
            "区间": "500_600",
            "人数": 965
        },
        {
            "区间": "600_700",
            "人数": 60
        },
        {
            "区间": "700_满分",
            "人数": 0
        }
    ]
}]
import pandas as pd

def dicttrans(data):
    result = {}
    for dict_item in data:
        for key, value in dict_item.items():
            if key in result:
                result[key].append(value)
            else:
                result[key] = [value]
    return result


def score_single(datasets):
    results = []

    for data in datasets:
        score = data["考试成绩"]
        result = {
            "学校": data["学校"],
            "考生姓名": data["考生姓名"],
            "班级": data["班级"],
            "准考证号": data["准考证号"],

            "总分": score[0]["分数"],
            "总分-班级排名": score[0]["班级排名"],
            "总分-全校排名": score[0]["学校排名"],
            "总分-联考排名": score[0]["联考排名"],
            "总分-全班平均分": data["班级考试情况"][0]["平均分"],
            "总分-全校平均分": data["学校考试情况"][0]["平均分"],
            "总分-联考平均分": data["联考考试情况"][0]["平均分"],
            "总分-全班最高分": data["班级考试情况"][0]["最高分"],
            "总分-全校最高分": data["学校考试情况"][0]["最高分"],
            "总分-联考最高分": data["联考考试情况"][0]["最高分"],

            "语文": score[1]["分数"],
            "语文-班级排名": score[1]["班级排名"],
            "语文-全校排名": score[1]["学校排名"],
            "语文-联考排名": score[1]["联考排名"],
            "语文-全班平均分": data["班级考试情况"][1]["平均分"],
            "语文-全校平均分": data["学校考试情况"][1]["平均分"],
            "语文-联考平均分": data["联考考试情况"][1]["平均分"],
            "语文-全班最高分": data["班级考试情况"][1]["最高分"],
            "语文-全校最高分": data["学校考试情况"][1]["最高分"],
            "语文-联考最高分": data["联考考试情况"][1]["最高分"],

            "数学": score[2]["分数"],
            "数学-班级排名": score[2]["班级排名"],
            "数学-全校排名": score[2]["学校排名"],
            "数学-联考排名": score[2]["联考排名"],
            "数学-全班平均分": data["班级考试情况"][2]["平均分"],
            "数学-全校平均分": data["学校考试情况"][2]["平均分"],
            "数学-联考平均分": data["联考考试情况"][2]["平均分"],
            "数学-全班最高分": data["班级考试情况"][2]["最高分"],
            "数学-全校最高分": data["学校考试情况"][2]["最高分"],
            "数学-联考最高分": data["联考考试情况"][2]["最高分"],

            "外语": score[3]["分数"],
            "外语-班级排名": score[3]["班级排名"],
            "外语-全校排名": score[3]["学校排名"],
            "外语-联考排名": score[3]["联考排名"],
            "外语-全班平均分": data["班级考试情况"][3]["平均分"],
            "外语-全校平均分": data["学校考试情况"][3]["平均分"],
            "外语-联考平均分": data["联考考试情况"][3]["平均分"],
            "外语-全班最高分": data["班级考试情况"][3]["最高分"],
            "外语-全校最高分": data["学校考试情况"][3]["最高分"],
            "外语-联考最高分": data["联考考试情况"][3]["最高分"],

            "政治": score[4]["分数"],
            "政治-班级排名": score[4]["班级排名"],
            "政治-全校排名": score[4]["学校排名"],
            "政治-联考排名": score[4]["联考排名"],
            "政治-全班平均分": data["班级考试情况"][4]["平均分"],
            "政治-全校平均分": data["学校考试情况"][4]["平均分"],
            "政治-联考平均分": data["联考考试情况"][4]["平均分"],
            "政治-全班最高分": data["班级考试情况"][4]["最高分"],
            "政治-全校最高分": data["学校考试情况"][4]["最高分"],
            "政治-联考最高分": data["联考考试情况"][4]["最高分"],

            "历史": score[5]["分数"],
            "历史-班级排名": score[5]["班级排名"],
            "历史-全校排名": score[5]["学校排名"],
            "历史-联考排名": score[5]["联考排名"],
            "历史-全班平均分": data["班级考试情况"][5]["平均分"],
            "历史-全校平均分": data["学校考试情况"][5]["平均分"],
            "历史-联考平均分": data["联考考试情况"][5]["平均分"],
            "历史-全班最高分": data["班级考试情况"][5]["最高分"],
            "历史-全校最高分": data["学校考试情况"][5]["最高分"],
            "历史-联考最高分": data["联考考试情况"][5]["最高分"],

            "地理": score[6]["分数"],
            "地理-班级排名": score[6]["班级排名"],
            "地理-全校排名": score[6]["学校排名"],
            "地理-联考排名": score[6]["联考排名"],
            "地理-全班平均分": data["班级考试情况"][6]["平均分"],
            "地理-全校平均分": data["学校考试情况"][6]["平均分"],
            "地理-联考平均分": data["联考考试情况"][6]["平均分"],
            "地理-全班最高分": data["班级考试情况"][6]["最高分"],
            "地理-全校最高分": data["学校考试情况"][6]["最高分"],
            "地理-联考最高分": data["联考考试情况"][6]["最高分"],

            "物理": score[7]["分数"],
            "物理-班级排名": score[7]["班级排名"],
            "物理-全校排名": score[7]["学校排名"],
            "物理-联考排名": score[7]["联考排名"],
            "物理-全班平均分": data["班级考试情况"][7]["平均分"],
            "物理-全校平均分": data["学校考试情况"][7]["平均分"],
            "物理-联考平均分": data["联考考试情况"][7]["平均分"],
            "物理-全班最高分": data["班级考试情况"][7]["最高分"],
            "物理-全校最高分": data["学校考试情况"][7]["最高分"],
            "物理-联考最高分": data["联考考试情况"][7]["最高分"],

            "化学": score[8]["分数"],
            "化学-班级排名": score[8]["班级排名"],
            "化学-全校排名": score[8]["学校排名"],
            "化学-联考排名": score[8]["联考排名"],
            "化学-全班平均分": data["班级考试情况"][8]["平均分"],
            "化学-全校平均分": data["学校考试情况"][8]["平均分"],
            "化学-联考平均分": data["联考考试情况"][8]["平均分"],
            "化学-全班最高分": data["班级考试情况"][8]["最高分"],
            "化学-全校最高分": data["学校考试情况"][8]["最高分"],
            "化学-联考最高分": data["联考考试情况"][8]["最高分"],

            "生物": score[9]["分数"],
            "生物-班级排名": score[9]["班级排名"],
            "生物-全校排名": score[9]["学校排名"],
            "生物-联考排名": score[9]["联考排名"],
            "生物-全班平均分": data["班级考试情况"][9]["平均分"],
            "生物-全校平均分": data["学校考试情况"][9]["平均分"],
            "生物-联考平均分": data["联考考试情况"][9]["平均分"],
            "生物-全班最高分": data["班级考试情况"][9]["最高分"],
            "生物-全校最高分": data["学校考试情况"][9]["最高分"],
            "生物-联考最高分": data["联考考试情况"][9]["最高分"],




        }
        results.append(result)

    return results


a = score_single(data)
b = dicttrans(a)

c=pd.DataFrame(b)
c.to_excel("data.xlsx",index=0)

print(b)
